04_OpenFoam/_ref/OpenFOAM-14/incompressibleVoF/floatingBeam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    atmosphere
    {
        type            prghTotalPressure;
        p0              $internalField;
        value           $internalField;
    }
    beam
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
